In [ ]:
#  INSTALL and ADD jupyter in you path file
#  At the COMMAND LINE navigate where you want to be and type.....
#  "jupyter-notebook . "
# Juypter is handy and interactive because it allows us to run code line by line instead
# of running everything similar to how R studio run R

In [5]:
import pandas as pd

In [46]:
# create a data frame structure where the columns are Name and Age
# the values in them are in a list format
data = {
    'Name':['Angela','Daniel','Marko','Marko','Angela'],
    'Age':[25,33,30,32,31],
}

In [47]:
df = pd.DataFrame(data)

In [48]:
df

     Name  Age
0  Angela   25
1  Daniel   33
2   Marko   30
3   Marko   32
4  Angela   31

In [49]:
df['Name']

0    Angela
1    Daniel
2     Marko
3     Marko
4    Angela
Name: Name, dtype: object

In [50]:
df['Age']

0    25
1    33
2    30
3    32
4    31
Name: Age, dtype: int64

In [51]:
# notice how this doesn't return a dataframe
df['Age'] >= 30

0    False
1     True
2     True
3     True
4     True
Name: Age, dtype: bool

In [52]:

my_filtered_df = df['Age'] >= 30

In [53]:
# but if you subset the original dataframe based on this boolean logic
# it does
df[my_filtered_df]

     Name  Age
1  Daniel   33
2   Marko   30
3   Marko   32
4  Angela   31

In [56]:
# gets rid of our duplicates row but only if there are the exactly the same
# 
df.drop_duplicates()

     Name  Age
0  Angela   25
1  Daniel   33
2   Marko   30
3   Marko   32
4  Angela   31

In [54]:
# we caan group the data frame by name
# agg is sort of like the summarise option in R

df.groupby('Name').agg({"Age":"mean"})

         Age
Name
Angela  28.0
Daniel  33.0
Marko   31.0